import torch

# 修改全局RNG(随机数生成器)状态
torch.manual_seed(123)

# 我们使用的dropout率为0.5
dropout = torch.nn.Dropout(0.5)
# 创建一个由1组成的矩阵
example = torch.ones(3, 3)   
print(example)
print(dropout(example))

"""
    - example: 
        [1., 1., 1.], 
        [1., 1., 1.], 
        [1., 1., 1.]
    - dropout:
        [2., 2., 0.], 
        [2., 2., 0.], 
        [0., 0., 0.]

    - 为什么要dropout？
        - 提高模型泛化能力，防止过拟合。
            通过随机丢弃一部分神经元或注意力权重，dropout 迫使模型在每次训练时学习略有不同的表示方式，而不是依赖某一特定的注意力模式。
            这种随机化的训练方式可以帮助模型在面对新数据时更具鲁棒性，减少过拟合的风险。
            注意力机制的冗余性在 Transformer 的注意力机制中，模型通常会对多个 token 进行注意力计算，实际上会有一些冗余信息。
            也就是说，不同 token 之间的信息通常会有部分重叠，并且模型能够从多个来源获取类似的信息。
            在这种情况下，dropout 随机丢弃一部分注意力权重并不会完全破坏模型的性能，因为模型可以依赖于其他未被丢弃的注意力路径来获取所需信息。

    - 为什么元素被放大2倍？
        当对注意力权重矩阵应用 50% 的 dropout 时，矩阵中一半的元素会被随机设置为零。
        为了补偿有效元素的减少，矩阵中剩余元素的值会被放大 1/0.5 = 2 倍。这个操作就做 缩放。
        这个缩放操作至关重要，可以在训练和推理阶段保持注意力机制的整体权重平衡，确保注意力机制在这两个阶段的平均影响保持一致。

    - 为什么要缩放？
        - 增大未遮盖值的相对差异：
            放大剩余权重后，它们的数值相对于被置零的权重增大，从而拉大了非零元素之间的相对差异。
            这使得在 Softmax 计算中（通过前文提过的Softmax公式推导，输入值的差异越大，输出分布就会越尖锐；而输入值差异越小，输出分布就会越平滑）​，剩下的值之间的对比更明显。
        - 影响 Softmax 输出的分布形态：
            当未被置零的权重值被放大后，它们在 Softmax 输出中会更具代表性，注意力分布会更集中（即更尖锐）​，让模型更关注特定的 token。
            缩放后的 Softmax 输入导致注意力分布更倾向于少数的高权重 token，使得模型在当前步骤更关注这些 token 的信息。
            这对模型的影响包括：增强模型的选择性关注：在训练中，模型会在每个步骤中随机选择不同的 token 进行更高的关注，这使模型在学习时不会依赖特定 token 的注意力。
        - 确保总注意力强度保持一致：
            即便经过 dropout 丢弃了一部分权重，缩放保证了剩余权重在 Softmax 后的分布与未应用 dropout 时类似。
        - 训练过程中多次迭代弥补信息丢失：
            在训练过程中，每个 batch 中的 dropout 掩码都是随机生成的。
            也就是说，在每次训练时被丢弃的注意力权重是随机的，并不会始终忽略相同的 token。
            这种随机性确保了在训练过程中，模型会在多个迭代中多次关注到每个 token。
            因此，即便某个 token 在当前的训练步中被忽略，在未来的训练步骤中它仍然会被关注到，从而在整体上避免了信息丢失的问题。
"""